[
    {
        "nome": "filth",
        "icon": "CSS/imagens/filthicon.png",
        "conteudo": "<img src='CSS/imagens/filth.png' style='float: right; height: 50vh'><h1>Filth</h1>\n<hr><br>\n<p>Filth são Husks Menores que aparecem pela primeira vez no tutorial antes da missão [0-1: INTO THE FIRE] e são os primeiros inimigos enfrentados no jogo. Eles são de longe os inimigos mais numerosos e servem como o rank-and-file que distrai e assedia o jogador.</p>\n<br><br>\n<h2>Aparência</h2><hr><br>\n<p>Filth parecem humanoides emagrecidos sem braços, olhos ou nariz, com apenas uma grande boca escancarada e dentes afiados, usados para morder e rasgar. Sua carne é de um tom esverdeado acinzentado com sangue seco cobrindo seus corpos.</p>\n<br><br>\n<h2>Combate</h2><hr><br>\n<p>Filth correrão constantemente em direção ao jogador em uma perseguição interminável, atingindo grande velocidade no chão para alcançá-lo. Eles frequentemente aparecem em hordas, servindo para distrair e pressionar o jogador. Seu ataque principal é um salto rápido para frente com uma mordida, causando 30 de dano; esse ataque pode ser aparado se o jogador acertar o tempo exato. É recomendado usar dash enquanto aparar para evitar ser atingido pelo ataque.</p>\n<br><br>\n<h2>Mudanças por Dificuldade</h2><hr><br>\n<ul>\n<li><span style='color:green;'>HARMLESS</span>\n<ul>\n<li>Filth se movem e atacam muito mais devagar do que o normal.</li>\n</ul>\n</li>\n<li><span style='color:yellow;'>LENIENT</span>\n<ul>\n<li>Filth se movem e atacam mais devagar do que o normal.</li>\n</ul>\n</li>\n<li><span style='color:red;'>VIOLENT</span>\n<ul>\n<li>Filth se movem e atacam mais rápido do que o normal.</li>\n<li>Ao aparar seu ataque de salto, o dano ainda não é cancelado sem usar dash para evitar o golpe.</li>\n</ul>\n</li>\n<li><span style='color:darkred;'>BRUTAL</span>\n<ul>\n<li>Filth se movem e atacam muito mais rápido do que o normal.</li>\n<li>Eles ganham um ataque de salto que permite acertar o jogador mesmo enquanto estão no ar.</li>\n</ul>\n</li>\n</ul>",
        "tipodeinimigo": "Husk"
    },
    {
        "nome": "stray",
        "icon": "CSS/imagens/strayicon.png",
        "conteudo": "<img src='CSS/imagens/stray.png' style='float: right; height: 50vh'><h1>Stray</h1>\n<hr><br>\n<p>Strays são Lesser Husks que aparecem pela primeira vez na missão [0-1: INTO THE FIRE]. Eles atuam como inimigos de projéteis que atacam o jogador à distância, tentando manter uma distância média e recuando quando se aproximam demais.</p>\n<br><br>\n<h2>Aparência</h2><hr><br>\n<p>Strays são humanoides altos e esqueléticos, com músculos e ossos expostos dando-lhes uma coloração vermelha notável. Eles parecem não ter órgãos internos ou olhos visíveis, apenas uma máscara ou espaço oco onde os olhos estariam. :contentReference[oaicite:0]{index=0}</p>\n<br><br>\n<h2>Combate</h2><hr><br>\n<p>Strays sempre tentam manter uma distância segura do jogador; se estiverem muito próximos, recuam, e se estiverem muito longe, eles se aproximam até ficarem ao alcance. Eles têm apenas um ataque: carregam e arremessam um único projétil de Hell Energy que causa dano ao acertar o jogador. O ataque é telegráfico — o Stray puxa o braço direito para trás e forma o projétil antes de lançá-lo. O projétil pode ser disparado ou aparado enquanto se forma ou enquanto viaja, podendo ser devolvido ao Stray. :contentReference[oaicite:1]{index=1}</p>\n<br><br>\n<h2>Mudanças por Dificuldade</h2><hr><br>\n<ul>\n<li><span style='color:green;'>HARMLESS</span>\n<ul>\n<li>Strays se movem e atacam muito mais devagar do que o normal.</li>\n</ul>\n</li>\n<li><span style='color:yellow;'>LENIENT</span>\n<ul>\n<li>Strays se movem e atacam mais devagar do que o normal.</li>\n</ul>\n</li>\n<li><span style='color:red;'>VIOLENT</span>\n<ul>\n<li>Strays se movem e atacam mais rápido do que o normal.</li>\n</ul>\n</li>\n<li><span style='color:darkred;'>BRUTAL</span>\n<ul>\n<li>Strays se movem e atacam muito mais rápido do que o normal.</li>\n<li>Eles tentarão prever levemente o movimento do jogador ao disparar seus projéteis.</li>\n</ul>\n</li>\n</ul>",
        "tipodeinimigo": "Husk"
    },
    {
        "nome": "malicious face",
        "icon": "CSS/imagens/maliciousfaceicon.png",
        "conteudo": "<img src='CSS/imagens/maurice.png' style='float: right; height: 30vh'><h1>Malicious Face</h1>\n<hr><br>\n<p>Malicious Faces, também conhecidos como Maurice, são Lesser Demons encontrados pela primeira vez como boss no final da missão [0-1: INTO THE FIRE], antes de se tornarem inimigos comuns na missão [0-4: A ONE-MACHINE ARMY]. Eles funcionam como grandes inimigos estáticos semelhantes a torres que lançam rajadas de projéteis e feixes contra o jogador.</p>\n<br><br>\n<h2>Aparência</h2><hr><br>\n<p>Malicious Faces parecem grandes cabeças de pedra com rostos esculpidos. À primeira vista parecem flutuar no ar, mas uma olhada mais atenta revela que eles ficam apoiados em quatro membros translúcidos parecidos com pernas de aranha. Ao morrer, esses membros desaparecem, fazendo com que a cabeça caia no chão.</p>\n<br><br>\n<h2>Combate</h2><hr><br>\n<p>Malicious Faces se movem lentamente, apenas se aproximando do jogador se estiverem fora do alcance. Quando estão em alcance, permanecem no lugar e bombardearão o jogador com rajadas de seis projéteis de Hell Energy disparados diretamente da boca, que podem ser aparados de volta para danificar o próprio Malicious Face. Alternativamente, ele pode começar a carregar um feixe de laser, indicado pela boca brilhando gradualmente em amarelo junto de um som de carregamento. Quando o feixe está pronto, o Malicious Face vira instantaneamente na direção em que o jogador está se movendo para tentar prever o alvo com maior precisão antes de dispará-lo; o feixe viaja instantaneamente e explode ao entrar em contato com qualquer superfície. Ele só usará esse ataque se o jogador estiver suficientemente próximo, mas seu uso pode se tornar mais frequente à medida que sua vida diminui. O feixe também pode ser aparado ao acertar o Malicious Face assim que o laser termina de carregar.</p>\n<p>Quando um Malicious Face morre, ele cai no chão, esmagando qualquer inimigo abaixo dele e criando uma onda de choque não danosa que lança o jogador e inimigos próximos pelo ar. Esse cadáver pode ser destruído com um ground slam. Projéteis explosivos ricochetearão nele, a menos que o Malicious Face esteja coberto por gasolina da Firestarter Rocket Launcher, o que remove sua imunidade a explosões.</p>\n<br><br>\n<h2 style='color:red;'>Enraged</h2><hr><br>\n<p>Na dificuldade Violent ou superior, Malicious Faces ficarão Enfurecidos assim que caírem abaixo de metade da vida, fazendo com que fiquem vermelhos e revelem olhos amarelos brilhantes. Quando Enfurecidos, eles atacam mais rápido e disparam dois lasers explosivos em sequência após cada carregamento.</p>\n<br><br>\n<h2>Mudanças por Dificuldade</h2><hr><br>\n<ul>\n<li><span style='color:green;'>HARMLESS</span>\n<ul>\n<li>Malicious Faces se movem e atacam muito mais devagar do que o normal.</li>\n<li>Eles disparam apenas três projéteis por rajada.</li>\n<li>O raio de explosão de seu feixe laser é menor.</li>\n</ul>\n</li>\n<li><span style='color:yellow;'>LENIENT</span>\n<ul>\n<li>Malicious Faces se movem e atacam mais devagar do que o normal.</li>\n<li>Eles disparam apenas três projéteis por rajada.</li>\n<li>O raio de explosão de seu feixe laser é menor.</li>\n</ul>\n</li>\n<li><span style='color:red;'>VIOLENT</span>\n<ul>\n<li>Malicious Faces se movem e atacam mais rápido do que o normal.</li>\n<li>Eles Enfurecem ao atingir metade da vida, fazendo-os atacar mais rápido e disparar seu feixe explosivo duas vezes em sequência.</li>\n</ul>\n</li>\n<li><span style='color:darkred;'>BRUTAL</span>\n<ul>\n<li>Malicious Faces se movem e atacam muito mais rápido do que o normal.</li>\n<li>Eles disparam dez projéteis por rajada, com um leve espalhamento.</li>\n<li>Eles Enfurecem ao atingir metade da vida, fazendo-os atacar mais rápido e disparar seu feixe explosivo duas vezes em sequência.</li>\n<li>Sua vida de chefe é aumentada de 25 para 38.</li>\n</ul>\n</li>\n</ul>",
        "tipodeinimigo": "Demônio"
    },
    {
        "nome": "swordmachine",
        "icon": "CSS/imagens/swordmachineicon.png",
        "conteudo": "<img src='CSS/imagens/swordmachine.png' style='float: right; height: 30vh'><h1>Swordsmachine</h1>\n<hr><br>\n<p>O Swordsmachine é uma Greater Machine encontrado como boss na missão [0-3: DOUBLE DOWN] e como inimigo comum em [6-1: CRY FOR THE WEEPER]. Eles também aparecem em [0-2: THE MEATGRINDER] em arenas paralelas à jornada do jogador, atacando com sua espada motorizada e escopeta anexada ao braço. Sua aparência assimétrica e reconstruída com sucata reflete sua natureza de combate e sobrevivência após o fim da humanidade.</p>\n<br><br>\n<h2>Aparência</h2><hr><br>\n<p>O Swordsmachine é uma máquina humanoide alta com armadura amarela e componentes expostos, um longo cabo retangular como cabeça com luzes azuis, uma espada motorizada na mão esquerda e uma escopeta no braço direito. Sua espada brilha e deixa um rastro de luz quando gira, e ele emite sons robóticos ao ser ferido ou sofrer parries.</p>\n<br><br>\n<h2>Combate</h2><hr><br>\n<p>O Swordsmachine persegue o jogador com grande velocidade e usa ataques com espada ou escopeta dependendo da distância. Na primeira fase, ele usa um combo de três golpes de espada, um ataque de corrida com a espada e um disparo de escopeta quando o jogador está longe. Após perder vida suficiente, ele entra na segunda fase, perde a escopeta e ganha ataques de arremesso de espada — uma lança que viaja até retornar — e um ataque espiral com a espada girando ao redor dele.</p>\n<br><br>\n<h2>Ataques</h2><hr><br>\n<p><strong>Shotgun Blast:</strong> na primeira fase, dispara um spread de 12 projéteis de escopeta quando o jogador está distante.</p>\n<p><strong>Running Swing:</strong> salta e balança a espada em um arco horizontal, causando dano ao contato.</p>\n<p><strong>Sword Combo:</strong> balance três golpes sequenciais com sua espada.</p>\n<p><strong>Sword Throw:</strong> lança sua espada em linha reta para a localização prevista do jogador, retornando depois com hitbox ativo.</p>\n<p><strong>Sword Spiral:</strong> gira a espada em um padrão espiral horizontal, causando dano ao contato.</p>\n<br><br>\n<h2 style='color:red;'>Enraged</h2><hr><br>\n<p>Quando refletido(parry) em qualquer ataque (exceto a escopeta), o Swordsmachine fica Enfurecido, ganhando maior velocidade de movimento e ataque, e seus ataques corpo a corpo tornam-se mais rápidos e frequentes. Parry-lo enquanto já está Enfurecido prolonga a duração do estado, que também é interrompido ao passar para a segunda fase.</p>\n<br><br>\n<h2>Mudanças por Dificuldade</h2><hr><br>\n<ul>\n<li><span style='color:green;'>HARMLESS</span>\n<ul>\n<li>Swordsmachines se movem e atacam muito mais devagar do que o normal.</li>\n<li>Eles se recuperam de atordoados muito mais devagar do que o normal.</li>\n</ul>\n</li>\n<li><span style='color:yellow;'>LENIENT</span>\n<ul>\n<li>Swordsmachines se movem e atacam mais devagar do que o normal.</li>\n<li>Eles se recuperam de atordoados mais devagar do que o normal.</li>\n</ul>\n</li>\n<li><span style='color:red;'>VIOLENT</span>\n<ul>\n<li>Swordsmachines se movem e atacam mais rápido do que o normal.</li>\n<li>Eles se recuperam de atordoados mais rápido do que o normal.</li>\n</ul>\n</li>\n<li><span style='color:darkred;'>BRUTAL</span>\n<ul>\n<li>Swordsmachines se movem e atacam muito mais rápido do que o normal.</li>\n<li>Eles se recuperam de atordoados muito mais rápido do que o normal.</li>\n<li>Podem continuar usando ataques corpo a corpo durante arremessos de espada antes do retorno.</li>\n<li>Podem usar escopeta e arremesso de espada enquanto estão Enfurecidos.</li>\n</ul>\n</li>\n</ul>",
        "tipodeinimigo": "Máquina"
    },
    {
        "nome": "virtue",
        "icon": "CSS/imagens/virtueicon.png",
        "conteudo": "<img src='CSS/imagens/virtue.png' style='float: right; height: 30vh'><h1>Virtue</h1>\n<hr><br>\n<p>Virtues são Anjos Menores que aparecem pela primeira vez na missão [4-1: SLAVES TO POWER]. Eles atuam como inimigos que flutuam no lugar, frequentemente assediando o jogador com ataques de feixe que causam dano a qualquer distância.</p>\n<br><br>\n<h2>Aparência</h2><hr><br>\n<p>Virtues são representações abstratas de seres angelicais, provavelmente baseadas na descrição bíblica de um Ophanim. Ao surgir, um Virtue emite um fraco brilho azul que se dissipa com o tempo. O corpo principal do Virtue é uma esfera azul e transparente que envolve um triângulo roxo. A esfera é cercada por blocos dourados que se conectam para formar dois anéis ao redor do corpo. Ele também é envolto por um campo de detritos dourados, além de um anel dourado acima de sua cabeça que serve como uma auréola. Virtues possuem duas asas azuis completas, usadas para voo, bem como duas asas menores que formam uma flecha abaixo do corpo.</p>\n<br><br>\n<h2>Combate</h2><hr><br>\n<p>Virtues utilizam um feixe de luz como seu único meio de ataque. O feixe é invocado por um glifo giratório que seguirá o jogador por um curto período. Quando está prestes a disparar, o glifo se fixa no lugar e gira rapidamente antes de lançar um feixe de luz celestial que causa 30 de dano. O feixe permanece por cerca de um segundo e não é afetado por altura ou cobertura. Pouco antes de o Virtue iniciar seu ataque de feixe, ele emitirá um breve brilho rosa a partir de seu corpo, que pode ser aparado. Aparar o Virtue não cancela o ataque de feixe, mas serve como um reabastecimento gratuito.</p>\n<p>Quando morto, a esfera do Virtue cairá no chão e se quebrará, liberando uma onda de choque que empurra o jogador para trás. Isso pode ser evitado ao causar um overkill no Virtue, fazendo com que ele simplesmente exploda no ar. Qualquer projétil que atinja a esfera em queda irá destruí-la, tornando o Alternate Revolver uma má escolha caso se queira usar a esfera para a onda de choque ou para apará-la. Apará-la fará com que a esfera funcione de forma idêntica à bala de canhão do S.R.S. Cannon Rocket Launcher, sem o quique, incluindo o dano extra contra Cerberus.</p>\n<br><br>\n<h2 style='color:red;'>Enraged</h2><hr><br>\n<p>Na dificuldade Standard ou superior, se um Virtue disparar múltiplos feixes e ainda estiver vivo, ele ficará Enfurecido, mudando de um azul brilhante e sagrado para um vermelho ardente. Normalmente, ele dispara cinco feixes antes de entrar em Fúria. Quando um Virtue Enfurecido ataca, os glifos que seguem o jogador tentarão prever para onde o jogador irá se mover em seguida, fazendo com que jogadores desatentos caminhem diretamente para dentro do feixe.</p>\n<p>Virtues só podem entrar em Fúria se houver menos de três deles vivos, e um Virtue protegido por um Idol será impedido de se Enfurecer. Um Virtue cuja Fúria seja inibida por qualquer um desses fatores ainda continuará contabilizando o número de ataques que realizou; reduzir o número de Virtues vivos ou destruir o Idol depois que um Virtue já tiver atingido seu limite de fúria fará com que ele se Enfureça no próximo ataque que iniciar.</p>\n<br><br>\n<h2>Mudanças por Dificuldade</h2><hr><br>\n<ul>\n<li><span style='color:green;'>HARMLESS</span>\n<ul>\n<li>Virtues se movem e atacam muito mais devagar do que o normal.</li>\n<li>Eles não podem entrar em Fúria.</li>\n</ul>\n</li>\n<li><span style='color:yellow;'>LENIENT</span>\n<ul>\n<li>Virtues se movem e atacam mais devagar do que o normal.</li>\n<li>Eles não podem entrar em Fúria.</li>\n</ul>\n</li>\n<li><span style='color:red;'>VIOLENT</span>\n<ul>\n<li>Virtues se movem e atacam mais rápido do que o normal.</li>\n<li>Eles entram em Fúria mais cedo, após três ataques de feixe.</li>\n<li>Sua Fúria não é mais inibida pela proteção de um Idol.</li>\n</ul>\n</li>\n<li><span style='color:darkred;'>BRUTAL</span>\n<ul>\n<li>Virtues se movem e atacam muito mais rápido do que o normal.</li>\n<li>Seus ataques de feixe permanecem por muito mais tempo do que o normal.</li>\n<li>Eles entram em Fúria mais cedo, após três ataques de feixe.</li>\n<li>Sua Fúria não é mais inibida pela proteção de um Idol.</li>\n</ul>\n</li>\n</ul>",
        "tipodeinimigo": "Anjo"
    },
    {
        "nome": "v2",
        "icon": "CSS/imagens/v2icon.png",
        "conteudo": "<img src='CSS/imagens/v2.png' style='float:right; height: 30vh'><h1>V2 - Primeiro Encontro</h1>\n<hr><br>\n<p>V2 é uma máquina suprema encontrada durante a excursão de V1 no final da primeira camada <span style='color:red'>(1-4)</span>. Eles são o primeiro boss realmente desafiador que o jogador encontra em sua jornada, utilizando um set de armas e até mesmo movimentos extremamente similar ao do jogador, o seu tamanho pequeno e imprevisibilidade o torna um inimigo formidável. V2 está quase no mesmo nível que o jogador em termos de mobilidade; ele pode dar dash, pular nas paredes e deslizar assim como o jogador, tornando-se um alvo difícil de acertar. Além disso, em seu primeiro encontro ele possui um Revólver Piercer e uma Escopeta Core Eject próprios, usando-os para alternar entre combate de curta e longa distância. Caso acerte uma das moedas do jogador, a moeda pode ricochetear o disparo de volta contra ele. Felizmente, como V2 não pode absorver sangue diretamente como V1, qualquer dano causado permanecerá até que a luta contra o chefe seja reiniciada. Os ataques de V2 consistem em armas com as quais o jogador já pode estar familiarizado, pois fazem parte do próprio arsenal do jogador. Com seu Revólver Piercer, ele pode disparar um combo de três tiros, precedido por um flash amarelo no cano da arma; com o tempo certo, um desses tiros pode ser aparado. Além disso, ele também pode realizar um único disparo carregado semelhante ao feixe do Revólver Piercer, indicado por um som de carregamento e uma luz azul brilhante vinda da arma; esse feixe pode ser aparado da mesma forma que os tiros normais, e V2 usará exclusivamente esse ataque se o jogador estiver mais distante. Junto do revólver, V2 também tem acesso a uma Escopeta Core Eject, que pode usar para disparar projéteis de perto contra o jogador, indicados por um som de chiado e um flash laranja; os projéteis da escopeta podem ser aparados.<br><br>V2 também pode decidir lançar um núcleo explosivo da escopeta, assim como a própria Escopeta Core Eject do jogador; esse ataque não possui um indicador visual, mas vem acompanhado de um som de motor antes de disparar o núcleo, que também pode ser atingido com qualquer arma hitscan para fazê-lo explodir.<br>V2 possui quatro padrões de movimento que utiliza dependendo da distância em relação ao jogador, e cada um é indicado pela cor de suas asas:<br><br><br><span style='color:yellow;'>Asas amarelas</span> significam que V2 escolherá uma direção para correr até colidir com algo, momento em que escolherá uma nova direção.<br><br><span style='color:blue;'>Asas azuis</span> significam que V2 tentará circular o jogador em movimento lateral enquanto se aproxima lentamente.<br><br><span style='color:red;'>Asas vermelhas</span> significam que V2 tentará avançar agressivamente contra o jogador, usando deslizes para reduzir a distância; ao alcançar uma distância mínima específica, ele passará a circular o jogador de perto até que o jogador recue ou até que o padrão de movimento mude novamente. Este é o único padrão de movimento que V2 utiliza quando está Enfurecido.<br><br><span style='color:green;'>Asas verdes</span> significam que V2 tentará rapidamente se afastar do jogador, ao custo de reduzir drasticamente sua velocidade de ataque; esse padrão é ativado quando o jogador permanece muito próximo de V2 por tempo demais, mas não será acionado se o jogador estiver com menos de 33 de vida.<br><br>Além disso, a velocidade de movimento de V2 possui vários possíveis efeitos negativos para facilitar levemente a recuperação de vida a partir de seu sangue:<br><br><br>O movimento no chão é 10% mais lento se o jogador tiver 33 de vida ou menos nas dificuldades Violent ou inferiores.<br><br>O movimento no chão é 10% mais lento se o jogador estiver a até 10 unidades de V2 nas dificuldades Standard ou inferiores (acumula com o efeito anterior).<br><br>Os saltos são mais curtos se o jogador estiver a até 10 unidades nas dificuldades Standard ou inferiores, com uma redução adicional na altura do salto se o jogador tiver 33 de vida ou menos.<br><br>V2 não pode deslizar a curta distância e cancelará o deslize mais cedo se o jogador tiver 50 de vida ou menos nas dificuldades Standard ou inferiores.<br><br>A velocidade de movimento no chão e no ar é reduzida enquanto V2 estiver preso por uma broca do Railcannon Screwdriver.</p>",
        "tipodeinimigo": "Boss"
    },
    {
        "nome": "puppet",
        "icon": "CSS/imagens/puppeticon.png",
        "conteudo": "<img src='CSS/imagens/puppet.png' style='float: right; height: 30vh'><h1>Puppets</h1>\n<hr><br>\n\n<p>\n    'Puppets' são inimigos encontrados exclusivamente em [7-3: NO SOUND, NO MEMORY],\n    assumindo a forma de humanoides de sangue sem traços definidos, que aparecem de\n    várias formas ao longo do nível.\n</p>\n<p>\n    Puppets são criaturas humanoides feitas inteiramente de sangue, sem quaisquer\n    características distinguíveis.\n</p><br><br>\n\n<h2>Combate</h2>\n<hr><br>\n<p>Puppets são enfrentados ao longo de quatro encontros em seu nível, imitando outros inimigos em cada luta. No primeiro encontro, eles se apresentam como inimigos lentos e arrastados, que causam pouco dano; no segundo encontro, passam a imitar a aparência e os ataques de um Filth. No terceiro encontro, o Puppet imita um Stray e, no quarto e último encontro, o Puppet imita os ataques e a aparência de um Mannequin.</p>\n<p>Puppets surgem infinitamente ao redor das árvores de sangue. Derrotá-los nas proximidades da árvore irá “regá-la”. Quando a árvore estiver completamente coberta de sangue, todos os Puppets restantes morrerão imediatamente e nenhum outro surgirá.</p>\n<br><br>\n<h2>Ataques</h2>\n<hr><br>\n<p>- Quando estão perto o suficiente de V1, os Puppets atacam de forma semelhante às Mindflayers, causando um mísero dano de 10, especialmente considerando o quão lentos eles são.</p>",
        "tipodeinimigo": "Outro"
    }
]
