[
    {
        "revolver_piercer": "Piercer",
        "conteudo_piercer": "<h1>Piercer Revolver</h1>\n<hr><br>\n<p>O Piercer Revolver é a variante azul do Revolver, encontrada em [0-1: INTO THE FIRE]. É a primeira arma que o jogador obtém em ULTRAKILL e combina um cano de revolver com tecnologia de railgun alimentada por baterias, disparando fragmentos metálicos em alta velocidade. Seu cilindro é carregado por baterias recarregáveis em vez de munição convencional, e o cano é uma abertura retangular brilhante em neon.</p>\n<br><br>\n<h2>Método de Ataque</h2>\n<hr><br>\n<p>O ataque primário dispara um único projétil hitscan, que causa 1 de dano por acerto e pode ser disparado continuamente ao manter o botão pressionado. Todos os tiros beneficiam multiplicadores de dano por localização, causando 1,5× em membros e 2× em tiros na cabeça. O ataque alternativo é carregado segurando o botão correspondente por cerca de meio segundo, disparando depois um feixe poderoso de três acertos que causa 1 de dano por hit, totalizando até 3 de dano ou mais com multiplicadores de localização. Após o disparo carregado, existe um tempo de recarga de cerca de 2,5 segundos antes que outro disparo carregado possa ser feito.</p>\n<br><br>\n<h2>Características</h2>\n<hr><br>\n<p>O Piercer pode perfurar até três inimigos fracos com seu disparo carregado ou concentrar dano em um único alvo. Seus tiros hitscan têm alcance infinito e não sofrem queda de dano. O disparo carregado pode ricochetear em moedas lançadas pelo Marksman Revolver, aumentando o dano. O ataque primário ainda pode ser usado durante o período de recarga do disparo alternativo.</p>\n<br><br>\n<h2>Uso e Estratégia</h2>\n<hr><br>\n<p>No início do jogo, o Piercer é útil para eliminar inimigos fracos como Filth e Drones devido à sua capacidade de atingir alvos à distância e penetrar múltiplos inimigos. Conforme o jogador obtém outras armas mais fortes ou melhores em controle de grupo, o uso do Piercer tende a diminuir, mas seu disparo carregado continua sendo uma ferramenta versátil para causar dano concentrado ou perfurar vários alvos.</p>",
        "imagem_piercer": "CSS/imagens/piercer.png",
        "revolver_sharpshooter": "Sharpshooter",
        "conteudo_sharpshooter": "<h1>Sharpshooter Revolver</h1>\n<hr><br>\n<p>O Sharpshooter Revolver é a variante vermelha do Revolver em ULTRAKILL, adquirida no Terminal após obter o Piercer Revolver. Visualmente, ele se destaca por possuir luzes vermelhas que indicam o número de cargas disponíveis e o estado de recarga do disparo alternativo.</p>\n<br><br>\n<h2>Método de Ataque</h2>\n<hr><br>\n<p>O ataque primário dispara um projétil hitscan rápido que causa pouco dano, mas se beneficia de multiplicadores ao acertar membros ou a cabeça dos inimigos. Ao segurar o ataque alternativo, o revolver começa a girar; ao soltar o botão, ele dispara um projétil penetrante envolto em energia vermelha, capaz de atravessar inimigos, ricochetear em superfícies e destruir projéteis inimigos. Quanto maior a velocidade de rotação antes do disparo, maior será o número de ricochetes possíveis.</p>\n<br><br>\n<h2>Características</h2>\n<hr><br>\n<p>O disparo alternativo possui cargas limitadas que se regeneram com o tempo. Cada acerto do projétil penetrante causa dano baixo individualmente, mas os ricochetes sucessivos aumentam significativamente o potencial ofensivo da arma. Além disso, o projétil pode destruir ataques inimigos no ar, causando pequenas explosões que podem atingir outros inimigos próximos.</p>\n<br><br>\n<h2>Uso e Estratégia</h2>\n<hr><br>\n<p>O Sharpshooter Revolver é especialmente eficaz em áreas com paredes próximas ou superfícies paralelas, onde os ricochetes podem ser explorados ao máximo. Ele é ideal para lidar com inimigos grandes ou grupos, além de oferecer utilidade defensiva ao neutralizar projéteis inimigos e criar oportunidades para combos e bônus de estilo.</p>",
        "imagem_sharpshooter": "CSS/imagens/sharpshooter.png",
        "revolver_marksman": "Marksman",
        "conteudo_marksman": "<h1>Marksman Revolver</h1>\n<hr><br>\n<p>O Marksman Revolver é a variante verde do Revolver em ULTRAKILL, desbloqueada após obter o Piercer Revolver. Ele se destaca por sua mecânica única envolvendo moedas, permitindo causar grandes quantidades de dano com tiros ricocheteados e recompensando precisão e bom posicionamento.</p>\n<br><br>\n<h2>Método de Ataque</h2>\n<hr><br>\n<p>O ataque primário dispara projéteis hitscan rápidos, causando 1 de dano por acerto, com multiplicadores de localização de 1,5× em membros e 2× em tiros na cabeça. O ataque alternativo lança uma moeda para o ar. Ao atirar nessa moeda, o projétil irá ricochetear automaticamente em direção ao inimigo mais próximo dentro do campo de visão do jogador, priorizando pontos fracos e aplicando multiplicadores de dano como se fosse um tiro crítico.</p>\n<br><br>\n<h2>Características</h2>\n<hr><br>\n<p>As moedas podem ser empilhadas no ar, permitindo múltiplos ricochetes em sequência. Cada ricochete aumenta o dano do tiro, possibilitando causar grandes explosões de dano em um único inimigo ou eliminar múltiplos alvos rapidamente. As moedas permanecem no ar por um curto período antes de cair e desaparecer. Tiros ricocheteados podem atravessar inimigos e interagir com outras mecânicas do jogo, como o disparo carregado do Piercer Revolver.</p>\n<br><br>\n<h2>Uso e Estratégia</h2>\n<hr><br>\n<p>O Marksman Revolver é extremamente poderoso quando utilizado com precisão e timing corretos, sendo eficaz tanto contra inimigos comuns quanto contra chefes. Jogadores habilidosos podem usar múltiplas moedas para maximizar o dano em curtos períodos de tempo. Apesar de exigir mais habilidade mecânica do que outras armas iniciais, ele permanece relevante durante todo o jogo devido ao seu alto potencial de dano e versatilidade em combate.</p>",
        "imagem_marksman": "CSS/imagens/marksman.png"
    },
    {
        "shotgun_coreeject": "Core Eject Shotgun",
        "conteudo_coreeject": "<h1>Core Eject Shotgun</h1>\n<hr><br>\n<p>A Core Eject Shotgun é uma das primeiras espingardas disponíveis em ULTRAKILL, obtida no início do jogo em [0-1: INTO THE FIRE]. Trata-se de uma arma focada em combate de curta distância, disparando múltiplos projéteis metálicos em um amplo espalhamento, sendo extremamente eficaz contra inimigos próximos.</p>\n<br><br>\n<h2>Método de Ataque</h2>\n<hr><br>\n<p>O ataque primário dispara uma rajada de projéteis em cone, causando alto dano a curta distância, mas perdendo eficiência conforme a distância aumenta. O ataque alternativo ejeta um núcleo explosivo para frente; esse núcleo pode ser atingido com qualquer arma hitscan para detoná-lo, causando uma explosão poderosa que inflige grande dano em área.</p>\n<br><br>\n<h2>Características</h2>\n<hr><br>\n<p>O núcleo ejetado é uma das principais características da arma, permitindo combos avançados e alto potencial de dano quando detonado corretamente. A explosão do núcleo pode atingir múltiplos inimigos e também o próprio jogador, exigindo cuidado no posicionamento. A Core Eject Shotgun é especialmente eficaz quando combinada com outras armas para disparar e explodir o núcleo rapidamente.</p>\n<br><br>\n<h2>Uso e Estratégia</h2>\n<hr><br>\n<p>Essa arma é ideal para eliminar grupos de inimigos e causar grande dano em inimigos mais resistentes. Aprender a explodir o núcleo de forma consistente é essencial para aproveitar todo o potencial da Core Eject Shotgun, tornando-a uma ferramenta poderosa tanto ofensiva quanto para geração de estilo.</p>",
        "imagem_coreeject": "CSS/imagens/coreeject.png",
        "shotgun_pump": "Pump Shotgun",
        "conteudo_pump": "<h1>Pump-Charge Shotgun</h1>\n<hr><br>\n<p>A Pump-Charge Shotgun é uma variante da Shotgun em ULTRAKILL, obtida após a Core Eject Shotgun. Ela mantém o funcionamento básico de uma espingarda de curto alcance, mas adiciona um mecanismo de carregamento que permite um disparo alternativo extremamente poderoso.</p>\n<br><br>\n<h2>Método de Ataque</h2>\n<hr><br>\n<p>O ataque primário dispara uma rajada de projéteis em um espalhamento amplo, eficaz contra inimigos próximos. O ataque alternativo carrega a bomba interna da arma; ao ser liberado, dispara um tiro concentrado e explosivo que causa dano massivo a curta distância. Quanto mais carregado o disparo, maior o dano causado.</p>\n<br><br>\n<h2>Características</h2>\n<hr><br>\n<p>O disparo carregado é a principal característica da Pump-Charge Shotgun, permitindo eliminar rapidamente inimigos resistentes. No entanto, o uso excessivo do carregamento pode danificar o próprio jogador, exigindo cuidado no gerenciamento do risco. A arma recompensa um estilo agressivo, mas consciente do posicionamento e do tempo de carregamento.</p>\n<br><br>\n<h2>Uso e Estratégia</h2>\n<hr><br>\n<p>A Pump-Charge Shotgun é ideal para confrontos intensos a curta distância, especialmente contra inimigos grandes ou chefes. Saber equilibrar o uso do ataque primário com o disparo carregado é essencial para maximizar o dano sem comprometer a sobrevivência, tornando a arma uma opção poderosa para jogadores que dominam o ritmo do combate.</p>",
        "imagem_pump": "CSS/imagens/pumpcharge.png",
        "shotgun_sawed": "Shotgun Sawed On",
        "conteudo_sawed": "<h1>Sawed-on Shotgun</h1>\n<hr><br>\n<p>A Sawed-on Shotgun é uma variante da Shotgun em ULTRAKILL que possui um cano encurtado, favorecendo um estilo de combate extremamente agressivo e focado em curta distância. Essa modificação reduz o alcance efetivo, mas aumenta a letalidade em confrontos próximos.</p>\n<br><br>\n<h2>Método de Ataque</h2>\n<hr><br>\n<p>O ataque primário dispara uma rajada de projéteis com espalhamento amplo, causando dano muito alto a curta distância. O ataque alternativo utiliza um disparo especial que consome as duas cargas da arma de uma só vez, resultando em um tiro mais poderoso e com maior impacto imediato.</p>\n<br><br>\n<h2>Características</h2>\n<hr><br>\n<p>A principal característica da Sawed-on Shotgun é a possibilidade de disparar ambas as cargas simultaneamente, permitindo explosões de dano extremamente rápidas. Essa mecânica torna a arma ideal para eliminar inimigos resistentes em poucos instantes, mas exige gerenciamento cuidadoso das cargas para não ficar vulnerável.</p>\n<br><br>\n<h2>Uso e Estratégia</h2>\n<hr><br>\n<p>A Sawed-on Shotgun é mais eficaz em ambientes fechados e contra inimigos que exigem dano imediato. Ela recompensa posicionamento agressivo e movimentação constante, sendo uma escolha excelente para jogadores que preferem um estilo de jogo rápido e de alto risco.</p>",
        "imagem_sawed": "CSS/imagens/sawedon.png"
    }
]